#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
google_apikeys_key.vc_api_key: Refreshing state... [id=projects/visitor-counter-prod/locations/global/keys/vc-api-key]
google_api_gateway_api.vc_api: Refreshing state... [id=projects/visitor-counter-prod/locations/global/apis/visitor-counter-api]
google_project_service.datastore: Refreshing state... [id=visitor-counter-prod/datastore.googleapis.com]
google_project_iam_member.tf_editor: Refreshing state... [id=visitor-counter-prod/roles/editor/serviceAccount:terraform-service-account@visitor-counter-prod.iam.gserviceaccount.com]
google_project_service.api_gateway: Refreshing state... [id=visitor-counter-prod/apigateway.googleapis.com]
google_project_service.container_registry: Refreshing state... [id=visitor-counter-prod/containerregistry.googleapis.com]
google_project_service.service_control: Refreshing state... [id=visitor-counter-prod/servicecontrol.googleapis.com]
google_project_iam_member.cloud_asset_owner: Refreshing state... [id=visitor-counter-prod/roles/cloudasset.owner/serviceAccount:github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com]
google_project_service.enable_vc_api: Refreshing state... [id=visitor-counter-prod/visitor-counter-api-0pb30vbmrig8i.apigateway.visitor-counter-prod.cloud.goog]
google_cloud_run_service.visitor-counter: Refreshing state... [id=locations/europe-west2/namespaces/visitor-counter-prod/services/visitor-counter]
google_service_account.tf_service_account: Refreshing state... [id=projects/visitor-counter-prod/serviceAccounts/terraform-service-account@visitor-counter-prod.iam.gserviceaccount.com]
google_project_service.gcp_resource_manager_api: Refreshing state... [id=visitor-counter-prod/cloudresourcemanager.googleapis.com]
google_service_account.gh_actions_account: Refreshing state... [id=projects/visitor-counter-prod/serviceAccounts/github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com]
google_iam_workload_identity_pool.counter-wi-pool: Refreshing state... [id=projects/visitor-counter-prod/locations/global/workloadIdentityPools/counter-wi-pool]
google_project_service.serviceusage: Refreshing state... [id=visitor-counter-prod/serviceusage.googleapis.com]
google_project_service.artifact_registry: Refreshing state... [id=visitor-counter-prod/artifactregistry.googleapis.com]
google_project_service.cloud-run: Refreshing state... [id=visitor-counter-prod/run.googleapis.com]
data.google_iam_policy.noauth: Reading...
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_service.cloud_asset: Refreshing state... [id=visitor-counter-prod/cloudasset.googleapis.com]
google_service_account_iam_binding.service-account-iam: Refreshing state... [id=projects/visitor-counter-prod/serviceAccounts/github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_project_service.iam_api: Refreshing state... [id=visitor-counter-prod/iam.googleapis.com]
google_iam_workload_identity_pool_provider.github_wi_provider: Refreshing state... [id=projects/visitor-counter-prod/locations/global/workloadIdentityPools/counter-wi-pool/providers/github-provider]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/visitor-counter-prod/locations/europe-west2/services/visitor-counter]
google_storage_bucket.default: Refreshing state... [id=donotuse-tf-backend]
google_api_gateway_api_config.counter_gwv3: Refreshing state... [id=projects/visitor-counter-prod/locations/global/apis/visitor-counter-api/configs/configv3]
google_api_gateway_gateway.api_gw: Refreshing state... [id=projects/visitor-counter-prod/locations/europe-west2/gateways/vc-api-gw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_api_gateway_api_config.counter_gwv3 must be replaced
+/- resource "google_api_gateway_api_config" "counter_gwv3" {
      + api_config_id_prefix = (known after apply)
      ~ display_name         = "configv3" -> (known after apply)
      ~ id                   = "projects/visitor-counter-prod/locations/global/apis/visitor-counter-api/configs/configv3" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/860934251761/locations/global/apis/visitor-counter-api/configs/configv3" -> (known after apply)
      ~ project              = "visitor-counter-prod" -> (known after apply)
      ~ service_config_id    = "configv3-07z7tdfr0p05o" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ openapi_documents {
          ~ document {
              ~ contents = "IyBvcGVuYXBpMi1ydW4ueWFtbApzd2FnZ2VyOiAnMi4wJwppbmZvOgogIHRpdGxlOiB2aXNpdG9yLWNvdW50ZXIKICBkZXNjcmlwdGlvbjogVmlzaXRvciBjb3VudGVyIG9uIEFQSSBHYXRld2F5IHdpdGggYSBDbG91ZCBSdW4gJiBEYXRhc3RvcmUgYmFja2VuZAogIHZlcnNpb246IDEuMC4wCnNjaGVtZXM6Ci0gaHR0cHMKcHJvZHVjZXM6Ci0gYXBwbGljYXRpb24vanNvbgp4LWdvb2dsZS1iYWNrZW5kOgogIGFkZHJlc3M6IGh0dHBzOi8vdmlzaXRvci1jb3VudGVyLWgzMmI2M21xbnEtbncuYS5ydW4uYXBwCnBhdGhzOgogIC92aXNpdHM6CiAgICBwb3N0OgogICAgICBzdW1tYXJ5OiBWaXNpdG9yIENvdW50CiAgICAgIG9wZXJhdGlvbklkOiB2aXNpdHMKICAgICAgc2VjdXJpdHk6CiAgICAgIC0gYXBpX2tleTogW10KICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEEgc3VjY2Vzc2Z1bCByZXNwb25zZQogICAgICAgICAgc2NoZW1hOgogICAgICAgICAgICB0eXBlOiBpbnRlZ2VyCnNlY3VyaXR5RGVmaW5pdGlvbnM6CiAgIyBUaGlzIHNlY3Rpb24gY29uZmlndXJlcyBiYXNpYyBhdXRoZW50aWNhdGlvbiB3aXRoIGFuIEFQSSBrZXkuCiAgYXBpX2tleToKICAgIHR5cGU6ICJhcGlLZXkiCiAgICBuYW1lOiAia2V5IgogICAgaW46ICJxdWVyeSI=" -> "IyBvcGVuYXBpMi1ydW4ueWFtbApzd2FnZ2VyOiAnMi4wJwppbmZvOgogIHRpdGxlOiB2aXNpdG9yLWNvdW50ZXIKICBkZXNjcmlwdGlvbjogVmlzaXRvciBjb3VudGVyIG9uIEFQSSBHYXRld2F5IHdpdGggYSBDbG91ZCBSdW4gJiBEYXRhc3RvcmUgYmFja2VuZAogIHZlcnNpb246IDEuMC4wCnNjaGVtZXM6Ci0gaHR0cHMKcHJvZHVjZXM6Ci0gYXBwbGljYXRpb24vanNvbgp4LWdvb2dsZS1iYWNrZW5kOgogIGFkZHJlc3M6IGh0dHBzOi8vdmlzaXRvci1jb3VudGVyLTZjaHl5ZjU1dXEtbncuYS5ydW4uYXBwCnBhdGhzOgogIC92aXNpdHM6CiAgICBwb3N0OgogICAgICBzdW1tYXJ5OiBWaXNpdG9yIENvdW50CiAgICAgIG9wZXJhdGlvbklkOiB2aXNpdHMKICAgICAgc2VjdXJpdHk6CiAgICAgIC0gYXBpX2tleTogW10KICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEEgc3VjY2Vzc2Z1bCByZXNwb25zZQogICAgICAgICAgc2NoZW1hOgogICAgICAgICAgICB0eXBlOiBpbnRlZ2VyCnNlY3VyaXR5RGVmaW5pdGlvbnM6CiAgIyBUaGlzIHNlY3Rpb24gY29uZmlndXJlcyBiYXNpYyBhdXRoZW50aWNhdGlvbiB3aXRoIGFuIEFQSSBrZXkuCiAgYXBpX2tleToKICAgIHR5cGU6ICJhcGlLZXkiCiAgICBuYW1lOiAia2V5IgogICAgaW46ICJxdWVyeSI=" # forces replacement
              ~ path     = "api-configs/prod-config.yaml" -> "api-configs/qa-config.yaml" # forces replacement
            }
        }
    }

  # google_api_gateway_gateway.api_gw will be updated in-place
  ~ resource "google_api_gateway_gateway" "api_gw" {
      ~ api_config       = "projects/860934251761/locations/global/apis/visitor-counter-api/configs/configv3" -> (known after apply)
        id               = "projects/visitor-counter-prod/locations/europe-west2/gateways/vc-api-gw"
        name             = "projects/visitor-counter-prod/locations/europe-west2/gateways/vc-api-gw"
        # (5 unchanged attributes hidden)
    }

  # google_apikeys_key.vc_api_key will be updated in-place
  ~ resource "google_apikeys_key" "vc_api_key" {
        id           = "projects/visitor-counter-prod/locations/global/keys/vc-api-key"
        name         = "vc-api-key"
        # (4 unchanged attributes hidden)

      ~ restrictions {

          ~ api_targets {
              ~ service = "visitor-counter-api-0pb30vbmrig8i.apigateway.visitor-counter-prod.cloud.goog" -> "visitor-counter-api-2tede7yicnc9f.apigateway.visitor-counter-qa.cloud.goog"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # google_cloud_run_service.visitor-counter will be updated in-place
  ~ resource "google_cloud_run_service" "visitor-counter" {
        id                         = "locations/europe-west2/namespaces/visitor-counter-prod/services/visitor-counter"
        name                       = "visitor-counter"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "client.knative.dev/user-image"     = "europe-west2-docker.pkg.dev/visitor-counter-prod/visitor-counter/visitor-counter:latest" -> null
              ~ "run.googleapis.com/client-name"    = "gcloud" -> "terraform"
              - "run.googleapis.com/client-version" = "405.0.0" -> null
              - "run.googleapis.com/ingress"        = "all" -> null
                # (3 unchanged elements hidden)
            }
            # (6 unchanged attributes hidden)
        }

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west2-docker.pkg.dev/visitor-counter-prod/visitor-counter/visitor-counter:latest" -> "europe-west2-docker.pkg.dev/visitor-counter-qa/visitor-counter/visitor-counter:latest"
                    # (2 unchanged attributes hidden)

                    # (2 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_project_iam_member.cloud_asset_owner must be replaced
-/+ resource "google_project_iam_member" "cloud_asset_owner" {
      ~ etag    = "BwXqwxDV68c=" -> (known after apply)
      ~ id      = "visitor-counter-prod/roles/cloudasset.owner/serviceAccount:github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com" -> "serviceAccount:github-actions-runner@visitor-counter-qa.iam.gserviceaccount.com" # forces replacement
      ~ project = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_project_iam_member.tf_editor must be replaced
-/+ resource "google_project_iam_member" "tf_editor" {
      ~ etag    = "BwXqwxDV68c=" -> (known after apply)
      ~ id      = "visitor-counter-prod/roles/editor/serviceAccount:terraform-service-account@visitor-counter-prod.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:terraform-service-account@visitor-counter-prod.iam.gserviceaccount.com" -> "serviceAccount:terraform-service-account@visitor-counter-qa.iam.gserviceaccount.com" # forces replacement
      ~ project = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_project_service.api_gateway must be replaced
-/+ resource "google_project_service" "api_gateway" {
      ~ id                 = "visitor-counter-prod/apigateway.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.artifact_registry must be replaced
-/+ resource "google_project_service" "artifact_registry" {
      ~ id                 = "visitor-counter-prod/artifactregistry.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.cloud-run must be replaced
-/+ resource "google_project_service" "cloud-run" {
      ~ id                 = "visitor-counter-prod/run.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.cloud_asset must be replaced
-/+ resource "google_project_service" "cloud_asset" {
      ~ id                 = "visitor-counter-prod/cloudasset.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.container_registry must be replaced
-/+ resource "google_project_service" "container_registry" {
      ~ id                 = "visitor-counter-prod/containerregistry.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.datastore must be replaced
-/+ resource "google_project_service" "datastore" {
      ~ id                 = "visitor-counter-prod/datastore.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.enable_vc_api must be replaced
-/+ resource "google_project_service" "enable_vc_api" {
      ~ id                 = "visitor-counter-prod/visitor-counter-api-0pb30vbmrig8i.apigateway.visitor-counter-prod.cloud.goog" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
      ~ service            = "visitor-counter-api-0pb30vbmrig8i.apigateway.visitor-counter-prod.cloud.goog" -> "visitor-counter-api-2tede7yicnc9f.apigateway.visitor-counter-qa.cloud.goog" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_project_service.gcp_resource_manager_api must be replaced
-/+ resource "google_project_service" "gcp_resource_manager_api" {
      ~ id                 = "visitor-counter-prod/cloudresourcemanager.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.iam_api must be replaced
-/+ resource "google_project_service" "iam_api" {
      ~ id                 = "visitor-counter-prod/iam.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.service_control must be replaced
-/+ resource "google_project_service" "service_control" {
      ~ id                 = "visitor-counter-prod/servicecontrol.googleapis.com" -> (known after apply)
      ~ project            = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.serviceusage must be replaced
-/+ resource "google_project_service" "serviceusage" {
      ~ id                         = "visitor-counter-prod/serviceusage.googleapis.com" -> (known after apply)
      ~ project                    = "visitor-counter-prod" -> "visitor-counter-qa" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # google_service_account_iam_binding.service-account-iam will be updated in-place
  ~ resource "google_service_account_iam_binding" "service-account-iam" {
        id                 = "projects/visitor-counter-prod/serviceAccounts/github-actions-runner@visitor-counter-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
      ~ members            = [
          + "principalSet://iam.googleapis.com/projects/300165146813/locations/global/workloadIdentityPools/counter-wi-pool/attribute.repository/CJ1138/visitor-counter",
          - "principalSet://iam.googleapis.com/projects/860934251761/locations/global/workloadIdentityPools/counter-wi-pool/attribute.repository/CJ1138/visitor-counter",
        ]
        # (3 unchanged attributes hidden)
    }

  # google_storage_bucket.default must be replaced
-/+ resource "google_storage_bucket" "default" {
      - default_event_based_hold    = false -> null
      ~ id                          = "donotuse-tf-backend" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "donotuse-tf-backend" -> "vc-qa-7968b717b2a4-bucket-tfstate" # forces replacement
      ~ project                     = "visitor-counter-prod" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/donotuse-tf-backend" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://donotuse-tf-backend" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 15 to add, 4 to change, 15 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CJ1138, Action: `pull_request`*